ir_version: 3
producer_name: ""
producer_version: ""
model_version: 0
graph {
  name: "mxnet_converted_model"
  node {
    input: "data"
    output: "id"
    name: "id"
    op_type: "Identity"
  }
  node {
    input: "id"
    input: "scalar_op2"
    output: "_minusscalar0"
    name: "_minusscalar0"
    op_type: "Sub"
  }
  node {
    input: "_minusscalar0"
    input: "scalar_op3"
    output: "_mulscalar0"
    name: "_mulscalar0"
    op_type: "Mul"
  }
  node {
    input: "_mulscalar0"
    input: "conv0_weight"
    output: "conv0"
    name: "conv0"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "conv0"
    input: "bn0_gamma"
    input: "bn0_beta"
    input: "bn0_moving_mean"
    input: "bn0_moving_var"
    output: "bn0"
    name: "bn0"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "relu0_gamma"
    input: "reshape12"
    output: "slope12"
    name: "slope12"
    op_type: "Reshape"
  }
  node {
    input: "bn0"
    input: "slope12"
    output: "relu0"
    name: "relu0"
    op_type: "PRelu"
  }
  node {
    input: "relu0"
    input: "stage1_unit1_bn1_gamma"
    input: "stage1_unit1_bn1_beta"
    input: "stage1_unit1_bn1_moving_mean"
    input: "stage1_unit1_bn1_moving_var"
    output: "stage1_unit1_bn1"
    name: "stage1_unit1_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage1_unit1_bn1"
    input: "stage1_unit1_conv1_weight"
    output: "stage1_unit1_conv1"
    name: "stage1_unit1_conv1"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage1_unit1_conv1"
    input: "stage1_unit1_bn2_gamma"
    input: "stage1_unit1_bn2_beta"
    input: "stage1_unit1_bn2_moving_mean"
    input: "stage1_unit1_bn2_moving_var"
    output: "stage1_unit1_bn2"
    name: "stage1_unit1_bn2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage1_unit1_relu1_gamma"
    input: "reshape26"
    output: "slope26"
    name: "slope26"
    op_type: "Reshape"
  }
  node {
    input: "stage1_unit1_bn2"
    input: "slope26"
    output: "stage1_unit1_relu1"
    name: "stage1_unit1_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage1_unit1_relu1"
    input: "stage1_unit1_conv2_weight"
    output: "stage1_unit1_conv2"
    name: "stage1_unit1_conv2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "stage1_unit1_conv2"
    input: "stage1_unit1_bn3_gamma"
    input: "stage1_unit1_bn3_beta"
    input: "stage1_unit1_bn3_moving_mean"
    input: "stage1_unit1_bn3_moving_var"
    output: "stage1_unit1_bn3"
    name: "stage1_unit1_bn3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "relu0"
    input: "stage1_unit1_conv1sc_weight"
    output: "stage1_unit1_conv1sc"
    name: "stage1_unit1_conv1sc"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "stage1_unit1_conv1sc"
    input: "stage1_unit1_sc_gamma"
    input: "stage1_unit1_sc_beta"
    input: "stage1_unit1_sc_moving_mean"
    input: "stage1_unit1_sc_moving_var"
    output: "stage1_unit1_sc"
    name: "stage1_unit1_sc"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage1_unit1_bn3"
    input: "stage1_unit1_sc"
    output: "_plus0"
    name: "_plus0"
    op_type: "Add"
  }
  node {
    input: "_plus0"
    input: "stage1_unit2_bn1_gamma"
    input: "stage1_unit2_bn1_beta"
    input: "stage1_unit2_bn1_moving_mean"
    input: "stage1_unit2_bn1_moving_var"
    output: "stage1_unit2_bn1"
    name: "stage1_unit2_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage1_unit2_bn1"
    input: "stage1_unit2_conv1_weight"
    output: "stage1_unit2_conv1"
    name: "stage1_unit2_conv1"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage1_unit2_conv1"
    input: "stage1_unit2_bn2_gamma"
    input: "stage1_unit2_bn2_beta"
    input: "stage1_unit2_bn2_moving_mean"
    input: "stage1_unit2_bn2_moving_var"
    output: "stage1_unit2_bn2"
    name: "stage1_unit2_bn2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage1_unit2_relu1_gamma"
    input: "reshape55"
    output: "slope55"
    name: "slope55"
    op_type: "Reshape"
  }
  node {
    input: "stage1_unit2_bn2"
    input: "slope55"
    output: "stage1_unit2_relu1"
    name: "stage1_unit2_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage1_unit2_relu1"
    input: "stage1_unit2_conv2_weight"
    output: "stage1_unit2_conv2"
    name: "stage1_unit2_conv2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage1_unit2_conv2"
    input: "stage1_unit2_bn3_gamma"
    input: "stage1_unit2_bn3_beta"
    input: "stage1_unit2_bn3_moving_mean"
    input: "stage1_unit2_bn3_moving_var"
    output: "stage1_unit2_bn3"
    name: "stage1_unit2_bn3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage1_unit2_bn3"
    input: "_plus0"
    output: "_plus1"
    name: "_plus1"
    op_type: "Add"
  }
  node {
    input: "_plus1"
    input: "stage1_unit3_bn1_gamma"
    input: "stage1_unit3_bn1_beta"
    input: "stage1_unit3_bn1_moving_mean"
    input: "stage1_unit3_bn1_moving_var"
    output: "stage1_unit3_bn1"
    name: "stage1_unit3_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage1_unit3_bn1"
    input: "stage1_unit3_conv1_weight"
    output: "stage1_unit3_conv1"
    name: "stage1_unit3_conv1"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage1_unit3_conv1"
    input: "stage1_unit3_bn2_gamma"
    input: "stage1_unit3_bn2_beta"
    input: "stage1_unit3_bn2_moving_mean"
    input: "stage1_unit3_bn2_moving_var"
    output: "stage1_unit3_bn2"
    name: "stage1_unit3_bn2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage1_unit3_relu1_gamma"
    input: "reshape77"
    output: "slope77"
    name: "slope77"
    op_type: "Reshape"
  }
  node {
    input: "stage1_unit3_bn2"
    input: "slope77"
    output: "stage1_unit3_relu1"
    name: "stage1_unit3_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage1_unit3_relu1"
    input: "stage1_unit3_conv2_weight"
    output: "stage1_unit3_conv2"
    name: "stage1_unit3_conv2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage1_unit3_conv2"
    input: "stage1_unit3_bn3_gamma"
    input: "stage1_unit3_bn3_beta"
    input: "stage1_unit3_bn3_moving_mean"
    input: "stage1_unit3_bn3_moving_var"
    output: "stage1_unit3_bn3"
    name: "stage1_unit3_bn3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage1_unit3_bn3"
    input: "_plus1"
    output: "_plus2"
    name: "_plus2"
    op_type: "Add"
  }
  node {
    input: "_plus2"
    input: "stage2_unit1_bn1_gamma"
    input: "stage2_unit1_bn1_beta"
    input: "stage2_unit1_bn1_moving_mean"
    input: "stage2_unit1_bn1_moving_var"
    output: "stage2_unit1_bn1"
    name: "stage2_unit1_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit1_bn1"
    input: "stage2_unit1_conv1_weight"
    output: "stage2_unit1_conv1"
    name: "stage2_unit1_conv1"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit1_conv1"
    input: "stage2_unit1_bn2_gamma"
    input: "stage2_unit1_bn2_beta"
    input: "stage2_unit1_bn2_moving_mean"
    input: "stage2_unit1_bn2_moving_var"
    output: "stage2_unit1_bn2"
    name: "stage2_unit1_bn2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit1_relu1_gamma"
    input: "reshape99"
    output: "slope99"
    name: "slope99"
    op_type: "Reshape"
  }
  node {
    input: "stage2_unit1_bn2"
    input: "slope99"
    output: "stage2_unit1_relu1"
    name: "stage2_unit1_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit1_relu1"
    input: "stage2_unit1_conv2_weight"
    output: "stage2_unit1_conv2"
    name: "stage2_unit1_conv2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "stage2_unit1_conv2"
    input: "stage2_unit1_bn3_gamma"
    input: "stage2_unit1_bn3_beta"
    input: "stage2_unit1_bn3_moving_mean"
    input: "stage2_unit1_bn3_moving_var"
    output: "stage2_unit1_bn3"
    name: "stage2_unit1_bn3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "_plus2"
    input: "stage2_unit1_conv1sc_weight"
    output: "stage2_unit1_conv1sc"
    name: "stage2_unit1_conv1sc"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "stage2_unit1_conv1sc"
    input: "stage2_unit1_sc_gamma"
    input: "stage2_unit1_sc_beta"
    input: "stage2_unit1_sc_moving_mean"
    input: "stage2_unit1_sc_moving_var"
    output: "stage2_unit1_sc"
    name: "stage2_unit1_sc"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit1_bn3"
    input: "stage2_unit1_sc"
    output: "_plus3"
    name: "_plus3"
    op_type: "Add"
  }
  node {
    input: "_plus3"
    input: "stage2_unit2_bn1_gamma"
    input: "stage2_unit2_bn1_beta"
    input: "stage2_unit2_bn1_moving_mean"
    input: "stage2_unit2_bn1_moving_var"
    output: "stage2_unit2_bn1"
    name: "stage2_unit2_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit2_bn1"
    input: "stage2_unit2_conv1_weight"
    output: "stage2_unit2_conv1"
    name: "stage2_unit2_conv1"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit2_conv1"
    input: "stage2_unit2_bn2_gamma"
    input: "stage2_unit2_bn2_beta"
    input: "stage2_unit2_bn2_moving_mean"
    input: "stage2_unit2_bn2_moving_var"
    output: "stage2_unit2_bn2"
    name: "stage2_unit2_bn2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit2_relu1_gamma"
    input: "reshape128"
    output: "slope128"
    name: "slope128"
    op_type: "Reshape"
  }
  node {
    input: "stage2_unit2_bn2"
    input: "slope128"
    output: "stage2_unit2_relu1"
    name: "stage2_unit2_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit2_relu1"
    input: "stage2_unit2_conv2_weight"
    output: "stage2_unit2_conv2"
    name: "stage2_unit2_conv2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit2_conv2"
    input: "stage2_unit2_bn3_gamma"
    input: "stage2_unit2_bn3_beta"
    input: "stage2_unit2_bn3_moving_mean"
    input: "stage2_unit2_bn3_moving_var"
    output: "stage2_unit2_bn3"
    name: "stage2_unit2_bn3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit2_bn3"
    input: "_plus3"
    output: "_plus4"
    name: "_plus4"
    op_type: "Add"
  }
  node {
    input: "_plus4"
    input: "stage2_unit3_bn1_gamma"
    input: "stage2_unit3_bn1_beta"
    input: "stage2_unit3_bn1_moving_mean"
    input: "stage2_unit3_bn1_moving_var"
    output: "stage2_unit3_bn1"
    name: "stage2_unit3_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit3_bn1"
    input: "stage2_unit3_conv1_weight"
    output: "stage2_unit3_conv1"
    name: "stage2_unit3_conv1"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit3_conv1"
    input: "stage2_unit3_bn2_gamma"
    input: "stage2_unit3_bn2_beta"
    input: "stage2_unit3_bn2_moving_mean"
    input: "stage2_unit3_bn2_moving_var"
    output: "stage2_unit3_bn2"
    name: "stage2_unit3_bn2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit3_relu1_gamma"
    input: "reshape150"
    output: "slope150"
    name: "slope150"
    op_type: "Reshape"
  }
  node {
    input: "stage2_unit3_bn2"
    input: "slope150"
    output: "stage2_unit3_relu1"
    name: "stage2_unit3_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit3_relu1"
    input: "stage2_unit3_conv2_weight"
    output: "stage2_unit3_conv2"
    name: "stage2_unit3_conv2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit3_conv2"
    input: "stage2_unit3_bn3_gamma"
    input: "stage2_unit3_bn3_beta"
    input: "stage2_unit3_bn3_moving_mean"
    input: "stage2_unit3_bn3_moving_var"
    output: "stage2_unit3_bn3"
    name: "stage2_unit3_bn3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit3_bn3"
    input: "_plus4"
    output: "_plus5"
    name: "_plus5"
    op_type: "Add"
  }
  node {
    input: "_plus5"
    input: "stage2_unit4_bn1_gamma"
    input: "stage2_unit4_bn1_beta"
    input: "stage2_unit4_bn1_moving_mean"
    input: "stage2_unit4_bn1_moving_var"
    output: "stage2_unit4_bn1"
    name: "stage2_unit4_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit4_bn1"
    input: "stage2_unit4_conv1_weight"
    output: "stage2_unit4_conv1"
    name: "stage2_unit4_conv1"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit4_conv1"
    input: "stage2_unit4_bn2_gamma"
    input: "stage2_unit4_bn2_beta"
    input: "stage2_unit4_bn2_moving_mean"
    input: "stage2_unit4_bn2_moving_var"
    output: "stage2_unit4_bn2"
    name: "stage2_unit4_bn2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit4_relu1_gamma"
    input: "reshape172"
    output: "slope172"
    name: "slope172"
    op_type: "Reshape"
  }
  node {
    input: "stage2_unit4_bn2"
    input: "slope172"
    output: "stage2_unit4_relu1"
    name: "stage2_unit4_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit4_relu1"
    input: "stage2_unit4_conv2_weight"
    output: "stage2_unit4_conv2"
    name: "stage2_unit4_conv2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit4_conv2"
    input: "stage2_unit4_bn3_gamma"
    input: "stage2_unit4_bn3_beta"
    input: "stage2_unit4_bn3_moving_mean"
    input: "stage2_unit4_bn3_moving_var"
    output: "stage2_unit4_bn3"
    name: "stage2_unit4_bn3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit4_bn3"
    input: "_plus5"
    output: "_plus6"
    name: "_plus6"
    op_type: "Add"
  }
  node {
    input: "_plus6"
    input: "stage2_unit5_bn1_gamma"
    input: "stage2_unit5_bn1_beta"
    input: "stage2_unit5_bn1_moving_mean"
    input: "stage2_unit5_bn1_moving_var"
    output: "stage2_unit5_bn1"
    name: "stage2_unit5_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit5_bn1"
    input: "stage2_unit5_conv1_weight"
    output: "stage2_unit5_conv1"
    name: "stage2_unit5_conv1"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit5_conv1"
    input: "stage2_unit5_bn2_gamma"
    input: "stage2_unit5_bn2_beta"
    input: "stage2_unit5_bn2_moving_mean"
    input: "stage2_unit5_bn2_moving_var"
    output: "stage2_unit5_bn2"
    name: "stage2_unit5_bn2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit5_relu1_gamma"
    input: "reshape194"
    output: "slope194"
    name: "slope194"
    op_type: "Reshape"
  }
  node {
    input: "stage2_unit5_bn2"
    input: "slope194"
    output: "stage2_unit5_relu1"
    name: "stage2_unit5_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit5_relu1"
    input: "stage2_unit5_conv2_weight"
    output: "stage2_unit5_conv2"
    name: "stage2_unit5_conv2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit5_conv2"
    input: "stage2_unit5_bn3_gamma"
    input: "stage2_unit5_bn3_beta"
    input: "stage2_unit5_bn3_moving_mean"
    input: "stage2_unit5_bn3_moving_var"
    output: "stage2_unit5_bn3"
    name: "stage2_unit5_bn3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit5_bn3"
    input: "_plus6"
    output: "_plus7"
    name: "_plus7"
    op_type: "Add"
  }
  node {
    input: "_plus7"
    input: "stage2_unit6_bn1_gamma"
    input: "stage2_unit6_bn1_beta"
    input: "stage2_unit6_bn1_moving_mean"
    input: "stage2_unit6_bn1_moving_var"
    output: "stage2_unit6_bn1"
    name: "stage2_unit6_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit6_bn1"
    input: "stage2_unit6_conv1_weight"
    output: "stage2_unit6_conv1"
    name: "stage2_unit6_conv1"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit6_conv1"
    input: "stage2_unit6_bn2_gamma"
    input: "stage2_unit6_bn2_beta"
    input: "stage2_unit6_bn2_moving_mean"
    input: "stage2_unit6_bn2_moving_var"
    output: "stage2_unit6_bn2"
    name: "stage2_unit6_bn2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit6_relu1_gamma"
    input: "reshape216"
    output: "slope216"
    name: "slope216"
    op_type: "Reshape"
  }
  node {
    input: "stage2_unit6_bn2"
    input: "slope216"
    output: "stage2_unit6_relu1"
    name: "stage2_unit6_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit6_relu1"
    input: "stage2_unit6_conv2_weight"
    output: "stage2_unit6_conv2"
    name: "stage2_unit6_conv2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit6_conv2"
    input: "stage2_unit6_bn3_gamma"
    input: "stage2_unit6_bn3_beta"
    input: "stage2_unit6_bn3_moving_mean"
    input: "stage2_unit6_bn3_moving_var"
    output: "stage2_unit6_bn3"
    name: "stage2_unit6_bn3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit6_bn3"
    input: "_plus7"
    output: "_plus8"
    name: "_plus8"
    op_type: "Add"
  }
  node {
    input: "_plus8"
    input: "stage2_unit7_bn1_gamma"
    input: "stage2_unit7_bn1_beta"
    input: "stage2_unit7_bn1_moving_mean"
    input: "stage2_unit7_bn1_moving_var"
    output: "stage2_unit7_bn1"
    name: "stage2_unit7_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit7_bn1"
    input: "stage2_unit7_conv1_weight"
    output: "stage2_unit7_conv1"
    name: "stage2_unit7_conv1"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit7_conv1"
    input: "stage2_unit7_bn2_gamma"
    input: "stage2_unit7_bn2_beta"
    input: "stage2_unit7_bn2_moving_mean"
    input: "stage2_unit7_bn2_moving_var"
    output: "stage2_unit7_bn2"
    name: "stage2_unit7_bn2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit7_relu1_gamma"
    input: "reshape238"
    output: "slope238"
    name: "slope238"
    op_type: "Reshape"
  }
  node {
    input: "stage2_unit7_bn2"
    input: "slope238"
    output: "stage2_unit7_relu1"
    name: "stage2_unit7_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit7_relu1"
    input: "stage2_unit7_conv2_weight"
    output: "stage2_unit7_conv2"
    name: "stage2_unit7_conv2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit7_conv2"
    input: "stage2_unit7_bn3_gamma"
    input: "stage2_unit7_bn3_beta"
    input: "stage2_unit7_bn3_moving_mean"
    input: "stage2_unit7_bn3_moving_var"
    output: "stage2_unit7_bn3"
    name: "stage2_unit7_bn3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit7_bn3"
    input: "_plus8"
    output: "_plus9"
    name: "_plus9"
    op_type: "Add"
  }
  node {
    input: "_plus9"
    input: "stage2_unit8_bn1_gamma"
    input: "stage2_unit8_bn1_beta"
    input: "stage2_unit8_bn1_moving_mean"
    input: "stage2_unit8_bn1_moving_var"
    output: "stage2_unit8_bn1"
    name: "stage2_unit8_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit8_bn1"
    input: "stage2_unit8_conv1_weight"
    output: "stage2_unit8_conv1"
    name: "stage2_unit8_conv1"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit8_conv1"
    input: "stage2_unit8_bn2_gamma"
    input: "stage2_unit8_bn2_beta"
    input: "stage2_unit8_bn2_moving_mean"
    input: "stage2_unit8_bn2_moving_var"
    output: "stage2_unit8_bn2"
    name: "stage2_unit8_bn2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit8_relu1_gamma"
    input: "reshape260"
    output: "slope260"
    name: "slope260"
    op_type: "Reshape"
  }
  node {
    input: "stage2_unit8_bn2"
    input: "slope260"
    output: "stage2_unit8_relu1"
    name: "stage2_unit8_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit8_relu1"
    input: "stage2_unit8_conv2_weight"
    output: "stage2_unit8_conv2"
    name: "stage2_unit8_conv2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit8_conv2"
    input: "stage2_unit8_bn3_gamma"
    input: "stage2_unit8_bn3_beta"
    input: "stage2_unit8_bn3_moving_mean"
    input: "stage2_unit8_bn3_moving_var"
    output: "stage2_unit8_bn3"
    name: "stage2_unit8_bn3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit8_bn3"
    input: "_plus9"
    output: "_plus10"
    name: "_plus10"
    op_type: "Add"
  }
  node {
    input: "_plus10"
    input: "stage2_unit9_bn1_gamma"
    input: "stage2_unit9_bn1_beta"
    input: "stage2_unit9_bn1_moving_mean"
    input: "stage2_unit9_bn1_moving_var"
    output: "stage2_unit9_bn1"
    name: "stage2_unit9_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit9_bn1"
    input: "stage2_unit9_conv1_weight"
    output: "stage2_unit9_conv1"
    name: "stage2_unit9_conv1"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit9_conv1"
    input: "stage2_unit9_bn2_gamma"
    input: "stage2_unit9_bn2_beta"
    input: "stage2_unit9_bn2_moving_mean"
    input: "stage2_unit9_bn2_moving_var"
    output: "stage2_unit9_bn2"
    name: "stage2_unit9_bn2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit9_relu1_gamma"
    input: "reshape282"
    output: "slope282"
    name: "slope282"
    op_type: "Reshape"
  }
  node {
    input: "stage2_unit9_bn2"
    input: "slope282"
    output: "stage2_unit9_relu1"
    name: "stage2_unit9_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit9_relu1"
    input: "stage2_unit9_conv2_weight"
    output: "stage2_unit9_conv2"
    name: "stage2_unit9_conv2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit9_conv2"
    input: "stage2_unit9_bn3_gamma"
    input: "stage2_unit9_bn3_beta"
    input: "stage2_unit9_bn3_moving_mean"
    input: "stage2_unit9_bn3_moving_var"
    output: "stage2_unit9_bn3"
    name: "stage2_unit9_bn3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit9_bn3"
    input: "_plus10"
    output: "_plus11"
    name: "_plus11"
    op_type: "Add"
  }
  node {
    input: "_plus11"
    input: "stage2_unit10_bn1_gamma"
    input: "stage2_unit10_bn1_beta"
    input: "stage2_unit10_bn1_moving_mean"
    input: "stage2_unit10_bn1_moving_var"
    output: "stage2_unit10_bn1"
    name: "stage2_unit10_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit10_bn1"
    input: "stage2_unit10_conv1_weight"
    output: "stage2_unit10_conv1"
    name: "stage2_unit10_conv1"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit10_conv1"
    input: "stage2_unit10_bn2_gamma"
    input: "stage2_unit10_bn2_beta"
    input: "stage2_unit10_bn2_moving_mean"
    input: "stage2_unit10_bn2_moving_var"
    output: "stage2_unit10_bn2"
    name: "stage2_unit10_bn2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit10_relu1_gamma"
    input: "reshape304"
    output: "slope304"
    name: "slope304"
    op_type: "Reshape"
  }
  node {
    input: "stage2_unit10_bn2"
    input: "slope304"
    output: "stage2_unit10_relu1"
    name: "stage2_unit10_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit10_relu1"
    input: "stage2_unit10_conv2_weight"
    output: "stage2_unit10_conv2"
    name: "stage2_unit10_conv2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit10_conv2"
    input: "stage2_unit10_bn3_gamma"
    input: "stage2_unit10_bn3_beta"
    input: "stage2_unit10_bn3_moving_mean"
    input: "stage2_unit10_bn3_moving_var"
    output: "stage2_unit10_bn3"
    name: "stage2_unit10_bn3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit10_bn3"
    input: "_plus11"
    output: "_plus12"
    name: "_plus12"
    op_type: "Add"
  }
  node {
    input: "_plus12"
    input: "stage2_unit11_bn1_gamma"
    input: "stage2_unit11_bn1_beta"
    input: "stage2_unit11_bn1_moving_mean"
    input: "stage2_unit11_bn1_moving_var"
    output: "stage2_unit11_bn1"
    name: "stage2_unit11_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit11_bn1"
    input: "stage2_unit11_conv1_weight"
    output: "stage2_unit11_conv1"
    name: "stage2_unit11_conv1"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit11_conv1"
    input: "stage2_unit11_bn2_gamma"
    input: "stage2_unit11_bn2_beta"
    input: "stage2_unit11_bn2_moving_mean"
    input: "stage2_unit11_bn2_moving_var"
    output: "stage2_unit11_bn2"
    name: "stage2_unit11_bn2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit11_relu1_gamma"
    input: "reshape326"
    output: "slope326"
    name: "slope326"
    op_type: "Reshape"
  }
  node {
    input: "stage2_unit11_bn2"
    input: "slope326"
    output: "stage2_unit11_relu1"
    name: "stage2_unit11_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit11_relu1"
    input: "stage2_unit11_conv2_weight"
    output: "stage2_unit11_conv2"
    name: "stage2_unit11_conv2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit11_conv2"
    input: "stage2_unit11_bn3_gamma"
    input: "stage2_unit11_bn3_beta"
    input: "stage2_unit11_bn3_moving_mean"
    input: "stage2_unit11_bn3_moving_var"
    output: "stage2_unit11_bn3"
    name: "stage2_unit11_bn3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit11_bn3"
    input: "_plus12"
    output: "_plus13"
    name: "_plus13"
    op_type: "Add"
  }
  node {
    input: "_plus13"
    input: "stage2_unit12_bn1_gamma"
    input: "stage2_unit12_bn1_beta"
    input: "stage2_unit12_bn1_moving_mean"
    input: "stage2_unit12_bn1_moving_var"
    output: "stage2_unit12_bn1"
    name: "stage2_unit12_bn1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit12_bn1"
    input: "stage2_unit12_conv1_weight"
    output: "stage2_unit12_conv1"
    name: "stage2_unit12_conv1"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit12_conv1"
    input: "stage2_unit12_bn2_gamma"
    input: "stage2_unit12_bn2_beta"
    input: "stage2_unit12_bn2_moving_mean"
    input: "stage2_unit12_bn2_moving_var"
    output: "stage2_unit12_bn2"
    name: "stage2_unit12_bn2"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "stage2_unit12_relu1_gamma"
    input: "reshape348"
    output: "slope348"
    name: "slope348"
    op_type: "Reshape"
  }
  node {
    input: "stage2_unit12_bn2"
    input: "slope348"
    output: "stage2_unit12_relu1"
    name: "stage2_unit12_relu1"
    op_type: "PRelu"
  }
  node {
    input: "stage2_unit12_relu1"
    input: "stage2_unit12_conv2_weight"
    output: "stage2_unit12_conv2"
    name: "stage2_unit12_conv2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "stage2_unit12_conv2"
    input: "stage2_unit12_bn3_gamma"
    input: "stage2_unit12_bn3_beta"
    input: "stage2_unit12_bn3_moving_mean"
    input: "stage2_unit12_bn3_moving_var"
    output: "stage2_unit12_bn3"
    name: "stage2_unit12_bn3"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1.9999999494757503e-05
      type: FLOAT
    }
