ir_version: 6
producer_name: "pytorch"
producer_version: "1.6"
model_version: 0
graph {
  name: "torch-jit-export"
  node {
    input: "img"
    input: "body.conv1.weight"
    output: "457"
    name: "Conv_0"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 3
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "457"
    input: "body.bn1.weight"
    input: "body.bn1.bias"
    input: "body.bn1.running_mean"
    input: "body.bn1.running_var"
    output: "458"
    name: "BatchNormalization_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "458"
    output: "459"
    name: "Relu_2"
    op_type: "Relu"
  }
  node {
    input: "459"
    output: "460"
    name: "MaxPool_3"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "460"
    input: "body.layer1.0.conv1.weight"
    output: "461"
    name: "Conv_4"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "461"
    input: "body.layer1.0.bn1.weight"
    input: "body.layer1.0.bn1.bias"
    input: "body.layer1.0.bn1.running_mean"
    input: "body.layer1.0.bn1.running_var"
    output: "462"
    name: "BatchNormalization_5"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "462"
    output: "463"
    name: "Relu_6"
    op_type: "Relu"
  }
  node {
    input: "463"
    input: "body.layer1.0.conv2.weight"
    output: "464"
    name: "Conv_7"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "464"
    input: "body.layer1.0.bn2.weight"
    input: "body.layer1.0.bn2.bias"
    input: "body.layer1.0.bn2.running_mean"
    input: "body.layer1.0.bn2.running_var"
    output: "465"
    name: "BatchNormalization_8"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "465"
    output: "466"
    name: "Relu_9"
    op_type: "Relu"
  }
  node {
    input: "466"
    input: "body.layer1.0.conv3.weight"
    output: "467"
    name: "Conv_10"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "467"
    input: "body.layer1.0.bn3.weight"
    input: "body.layer1.0.bn3.bias"
    input: "body.layer1.0.bn3.running_mean"
    input: "body.layer1.0.bn3.running_var"
    output: "468"
    name: "BatchNormalization_11"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "460"
    input: "body.layer1.0.downsample.0.weight"
    output: "469"
    name: "Conv_12"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "469"
    input: "body.layer1.0.downsample.1.weight"
    input: "body.layer1.0.downsample.1.bias"
    input: "body.layer1.0.downsample.1.running_mean"
    input: "body.layer1.0.downsample.1.running_var"
    output: "470"
    name: "BatchNormalization_13"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "468"
    input: "470"
    output: "471"
    name: "Add_14"
    op_type: "Add"
  }
  node {
    input: "471"
    output: "472"
    name: "Relu_15"
    op_type: "Relu"
  }
  node {
    input: "472"
    input: "body.layer1.1.conv1.weight"
    output: "473"
    name: "Conv_16"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "473"
    input: "body.layer1.1.bn1.weight"
    input: "body.layer1.1.bn1.bias"
    input: "body.layer1.1.bn1.running_mean"
    input: "body.layer1.1.bn1.running_var"
    output: "474"
    name: "BatchNormalization_17"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "474"
    output: "475"
    name: "Relu_18"
    op_type: "Relu"
  }
  node {
    input: "475"
    input: "body.layer1.1.conv2.weight"
    output: "476"
    name: "Conv_19"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "476"
    input: "body.layer1.1.bn2.weight"
    input: "body.layer1.1.bn2.bias"
    input: "body.layer1.1.bn2.running_mean"
    input: "body.layer1.1.bn2.running_var"
    output: "477"
    name: "BatchNormalization_20"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "477"
    output: "478"
    name: "Relu_21"
    op_type: "Relu"
  }
  node {
    input: "478"
    input: "body.layer1.1.conv3.weight"
    output: "479"
    name: "Conv_22"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "479"
    input: "body.layer1.1.bn3.weight"
    input: "body.layer1.1.bn3.bias"
    input: "body.layer1.1.bn3.running_mean"
    input: "body.layer1.1.bn3.running_var"
    output: "480"
    name: "BatchNormalization_23"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "480"
    input: "472"
    output: "481"
    name: "Add_24"
    op_type: "Add"
  }
  node {
    input: "481"
    output: "482"
    name: "Relu_25"
    op_type: "Relu"
  }
  node {
    input: "482"
    input: "body.layer1.2.conv1.weight"
    output: "483"
    name: "Conv_26"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "483"
    input: "body.layer1.2.bn1.weight"
    input: "body.layer1.2.bn1.bias"
    input: "body.layer1.2.bn1.running_mean"
    input: "body.layer1.2.bn1.running_var"
    output: "484"
    name: "BatchNormalization_27"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "484"
    output: "485"
    name: "Relu_28"
    op_type: "Relu"
  }
  node {
    input: "485"
    input: "body.layer1.2.conv2.weight"
    output: "486"
    name: "Conv_29"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "486"
    input: "body.layer1.2.bn2.weight"
    input: "body.layer1.2.bn2.bias"
    input: "body.layer1.2.bn2.running_mean"
    input: "body.layer1.2.bn2.running_var"
    output: "487"
    name: "BatchNormalization_30"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "487"
    output: "488"
    name: "Relu_31"
    op_type: "Relu"
  }
  node {
    input: "488"
    input: "body.layer1.2.conv3.weight"
    output: "489"
    name: "Conv_32"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "489"
    input: "body.layer1.2.bn3.weight"
    input: "body.layer1.2.bn3.bias"
    input: "body.layer1.2.bn3.running_mean"
    input: "body.layer1.2.bn3.running_var"
    output: "490"
    name: "BatchNormalization_33"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "490"
    input: "482"
    output: "491"
    name: "Add_34"
    op_type: "Add"
  }
  node {
    input: "491"
    output: "492"
    name: "Relu_35"
    op_type: "Relu"
  }
  node {
    input: "492"
    input: "body.layer2.0.conv1.weight"
    output: "493"
    name: "Conv_36"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "493"
    input: "body.layer2.0.bn1.weight"
    input: "body.layer2.0.bn1.bias"
    input: "body.layer2.0.bn1.running_mean"
    input: "body.layer2.0.bn1.running_var"
    output: "494"
    name: "BatchNormalization_37"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "494"
    output: "495"
    name: "Relu_38"
    op_type: "Relu"
  }
  node {
    input: "495"
    input: "body.layer2.0.conv2.weight"
    output: "496"
    name: "Conv_39"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "496"
    input: "body.layer2.0.bn2.weight"
    input: "body.layer2.0.bn2.bias"
    input: "body.layer2.0.bn2.running_mean"
    input: "body.layer2.0.bn2.running_var"
    output: "497"
    name: "BatchNormalization_40"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "497"
    output: "498"
    name: "Relu_41"
    op_type: "Relu"
  }
  node {
    input: "498"
    input: "body.layer2.0.conv3.weight"
    output: "499"
    name: "Conv_42"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "499"
    input: "body.layer2.0.bn3.weight"
    input: "body.layer2.0.bn3.bias"
    input: "body.layer2.0.bn3.running_mean"
    input: "body.layer2.0.bn3.running_var"
    output: "500"
    name: "BatchNormalization_43"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "492"
    input: "body.layer2.0.downsample.0.weight"
    output: "501"
    name: "Conv_44"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "501"
    input: "body.layer2.0.downsample.1.weight"
    input: "body.layer2.0.downsample.1.bias"
    input: "body.layer2.0.downsample.1.running_mean"
    input: "body.layer2.0.downsample.1.running_var"
    output: "502"
    name: "BatchNormalization_45"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "500"
    input: "502"
    output: "503"
    name: "Add_46"
    op_type: "Add"
  }
  node {
    input: "503"
    output: "504"
    name: "Relu_47"
    op_type: "Relu"
  }
  node {
    input: "504"
    input: "body.layer2.1.conv1.weight"
    output: "505"
    name: "Conv_48"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "505"
    input: "body.layer2.1.bn1.weight"
    input: "body.layer2.1.bn1.bias"
    input: "body.layer2.1.bn1.running_mean"
    input: "body.layer2.1.bn1.running_var"
    output: "506"
    name: "BatchNormalization_49"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "506"
    output: "507"
    name: "Relu_50"
    op_type: "Relu"
  }
  node {
    input: "507"
    input: "body.layer2.1.conv2.weight"
    output: "508"
    name: "Conv_51"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "508"
    input: "body.layer2.1.bn2.weight"
    input: "body.layer2.1.bn2.bias"
    input: "body.layer2.1.bn2.running_mean"
    input: "body.layer2.1.bn2.running_var"
    output: "509"
    name: "BatchNormalization_52"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "509"
    output: "510"
    name: "Relu_53"
    op_type: "Relu"
  }
  node {
    input: "510"
    input: "body.layer2.1.conv3.weight"
    output: "511"
    name: "Conv_54"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "511"
    input: "body.layer2.1.bn3.weight"
    input: "body.layer2.1.bn3.bias"
    input: "body.layer2.1.bn3.running_mean"
    input: "body.layer2.1.bn3.running_var"
    output: "512"
    name: "BatchNormalization_55"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "512"
    input: "504"
    output: "513"
    name: "Add_56"
    op_type: "Add"
  }
  node {
    input: "513"
    output: "514"
    name: "Relu_57"
    op_type: "Relu"
  }
  node {
    input: "514"
    input: "body.layer2.2.conv1.weight"
    output: "515"
    name: "Conv_58"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "515"
    input: "body.layer2.2.bn1.weight"
    input: "body.layer2.2.bn1.bias"
    input: "body.layer2.2.bn1.running_mean"
    input: "body.layer2.2.bn1.running_var"
    output: "516"
    name: "BatchNormalization_59"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "516"
    output: "517"
    name: "Relu_60"
    op_type: "Relu"
  }
  node {
    input: "517"
    input: "body.layer2.2.conv2.weight"
    output: "518"
    name: "Conv_61"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "518"
    input: "body.layer2.2.bn2.weight"
    input: "body.layer2.2.bn2.bias"
    input: "body.layer2.2.bn2.running_mean"
    input: "body.layer2.2.bn2.running_var"
    output: "519"
    name: "BatchNormalization_62"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "519"
    output: "520"
    name: "Relu_63"
    op_type: "Relu"
  }
  node {
    input: "520"
    input: "body.layer2.2.conv3.weight"
    output: "521"
    name: "Conv_64"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "521"
    input: "body.layer2.2.bn3.weight"
    input: "body.layer2.2.bn3.bias"
    input: "body.layer2.2.bn3.running_mean"
    input: "body.layer2.2.bn3.running_var"
    output: "522"
    name: "BatchNormalization_65"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "522"
    input: "514"
    output: "523"
    name: "Add_66"
    op_type: "Add"
  }
  node {
    input: "523"
    output: "524"
    name: "Relu_67"
    op_type: "Relu"
  }
  node {
    input: "524"
    input: "body.layer2.3.conv1.weight"
    output: "525"
    name: "Conv_68"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "525"
    input: "body.layer2.3.bn1.weight"
    input: "body.layer2.3.bn1.bias"
    input: "body.layer2.3.bn1.running_mean"
    input: "body.layer2.3.bn1.running_var"
    output: "526"
    name: "BatchNormalization_69"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "526"
    output: "527"
    name: "Relu_70"
    op_type: "Relu"
  }
  node {
    input: "527"
    input: "body.layer2.3.conv2.weight"
    output: "528"
    name: "Conv_71"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "528"
    input: "body.layer2.3.bn2.weight"
    input: "body.layer2.3.bn2.bias"
    input: "body.layer2.3.bn2.running_mean"
    input: "body.layer2.3.bn2.running_var"
    output: "529"
    name: "BatchNormalization_72"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "529"
    output: "530"
    name: "Relu_73"
    op_type: "Relu"
  }
  node {
    input: "530"
    input: "body.layer2.3.conv3.weight"
    output: "531"
    name: "Conv_74"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "531"
    input: "body.layer2.3.bn3.weight"
    input: "body.layer2.3.bn3.bias"
    input: "body.layer2.3.bn3.running_mean"
    input: "body.layer2.3.bn3.running_var"
    output: "532"
    name: "BatchNormalization_75"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "532"
    input: "524"
    output: "533"
    name: "Add_76"
    op_type: "Add"
  }
  node {
    input: "533"
    output: "534"
    name: "Relu_77"
    op_type: "Relu"
  }
  node {
    input: "534"
    input: "body.layer3.0.conv1.weight"
    output: "535"
    name: "Conv_78"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "535"
    input: "body.layer3.0.bn1.weight"
    input: "body.layer3.0.bn1.bias"
    input: "body.layer3.0.bn1.running_mean"
    input: "body.layer3.0.bn1.running_var"
    output: "536"
    name: "BatchNormalization_79"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "536"
    output: "537"
    name: "Relu_80"
    op_type: "Relu"
  }
  node {
    input: "537"
    input: "body.layer3.0.conv2.weight"
    output: "538"
    name: "Conv_81"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "538"
    input: "body.layer3.0.bn2.weight"
    input: "body.layer3.0.bn2.bias"
    input: "body.layer3.0.bn2.running_mean"
    input: "body.layer3.0.bn2.running_var"
    output: "539"
    name: "BatchNormalization_82"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "539"
    output: "540"
    name: "Relu_83"
    op_type: "Relu"
  }
  node {
    input: "540"
    input: "body.layer3.0.conv3.weight"
    output: "541"
    name: "Conv_84"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "541"
    input: "body.layer3.0.bn3.weight"
    input: "body.layer3.0.bn3.bias"
    input: "body.layer3.0.bn3.running_mean"
    input: "body.layer3.0.bn3.running_var"
    output: "542"
    name: "BatchNormalization_85"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "534"
    input: "body.layer3.0.downsample.0.weight"
    output: "543"
    name: "Conv_86"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "543"
    input: "body.layer3.0.downsample.1.weight"
    input: "body.layer3.0.downsample.1.bias"
    input: "body.layer3.0.downsample.1.running_mean"
    input: "body.layer3.0.downsample.1.running_var"
    output: "544"
    name: "BatchNormalization_87"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "542"
    input: "544"
    output: "545"
    name: "Add_88"
    op_type: "Add"
  }
  node {
    input: "545"
    output: "546"
    name: "Relu_89"
    op_type: "Relu"
  }
  node {
    input: "546"
    input: "body.layer3.1.conv1.weight"
    output: "547"
    name: "Conv_90"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "547"
    input: "body.layer3.1.bn1.weight"
    input: "body.layer3.1.bn1.bias"
    input: "body.layer3.1.bn1.running_mean"
    input: "body.layer3.1.bn1.running_var"
    output: "548"
    name: "BatchNormalization_91"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "548"
    output: "549"
    name: "Relu_92"
    op_type: "Relu"
  }
  node {
    input: "549"
    input: "body.layer3.1.conv2.weight"
    output: "550"
    name: "Conv_93"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "550"
    input: "body.layer3.1.bn2.weight"
    input: "body.layer3.1.bn2.bias"
    input: "body.layer3.1.bn2.running_mean"
    input: "body.layer3.1.bn2.running_var"
    output: "551"
    name: "BatchNormalization_94"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "551"
    output: "552"
    name: "Relu_95"
    op_type: "Relu"
  }
  node {
    input: "552"
    input: "body.layer3.1.conv3.weight"
    output: "553"
    name: "Conv_96"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "553"
    input: "body.layer3.1.bn3.weight"
    input: "body.layer3.1.bn3.bias"
    input: "body.layer3.1.bn3.running_mean"
    input: "body.layer3.1.bn3.running_var"
    output: "554"
    name: "BatchNormalization_97"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "554"
    input: "546"
    output: "555"
    name: "Add_98"
    op_type: "Add"
  }
  node {
    input: "555"
    output: "556"
    name: "Relu_99"
    op_type: "Relu"
  }
  node {
    input: "556"
    input: "body.layer3.2.conv1.weight"
    output: "557"
    name: "Conv_100"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "557"
    input: "body.layer3.2.bn1.weight"
    input: "body.layer3.2.bn1.bias"
    input: "body.layer3.2.bn1.running_mean"
    input: "body.layer3.2.bn1.running_var"
    output: "558"
    name: "BatchNormalization_101"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "558"
    output: "559"
    name: "Relu_102"
    op_type: "Relu"
  }
  node {
    input: "559"
    input: "body.layer3.2.conv2.weight"
    output: "560"
    name: "Conv_103"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "560"
    input: "body.layer3.2.bn2.weight"
    input: "body.layer3.2.bn2.bias"
    input: "body.layer3.2.bn2.running_mean"
    input: "body.layer3.2.bn2.running_var"
    output: "561"
    name: "BatchNormalization_104"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "561"
    output: "562"
    name: "Relu_105"
    op_type: "Relu"
  }
  node {
    input: "562"
    input: "body.layer3.2.conv3.weight"
    output: "563"
    name: "Conv_106"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "563"
    input: "body.layer3.2.bn3.weight"
    input: "body.layer3.2.bn3.bias"
    input: "body.layer3.2.bn3.running_mean"
    input: "body.layer3.2.bn3.running_var"
    output: "564"
    name: "BatchNormalization_107"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "564"
    input: "556"
    output: "565"
    name: "Add_108"
    op_type: "Add"
  }
  node {
    input: "565"
    output: "566"
    name: "Relu_109"
    op_type: "Relu"
  }
  node {
    input: "566"
    input: "body.layer3.3.conv1.weight"
    output: "567"
    name: "Conv_110"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "567"
    input: "body.layer3.3.bn1.weight"
    input: "body.layer3.3.bn1.bias"
    input: "body.layer3.3.bn1.running_mean"
    input: "body.layer3.3.bn1.running_var"
    output: "568"
    name: "BatchNormalization_111"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "568"
    output: "569"
    name: "Relu_112"
    op_type: "Relu"
  }
  node {
    input: "569"
    input: "body.layer3.3.conv2.weight"
    output: "570"
    name: "Conv_113"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "570"
    input: "body.layer3.3.bn2.weight"
    input: "body.layer3.3.bn2.bias"
    input: "body.layer3.3.bn2.running_mean"
    input: "body.layer3.3.bn2.running_var"
    output: "571"
    name: "BatchNormalization_114"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "571"
    output: "572"
    name: "Relu_115"
    op_type: "Relu"
  }
  node {
    input: "572"
    input: "body.layer3.3.conv3.weight"
    output: "573"
    name: "Conv_116"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "573"
    input: "body.layer3.3.bn3.weight"
    input: "body.layer3.3.bn3.bias"
    input: "body.layer3.3.bn3.running_mean"
    input: "body.layer3.3.bn3.running_var"
    output: "574"
    name: "BatchNormalization_117"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "574"
    input: "566"
    output: "575"
    name: "Add_118"
    op_type: "Add"
  }
  node {
    input: "575"
    output: "576"
    name: "Relu_119"
    op_type: "Relu"
  }
  node {
    input: "576"
    input: "body.layer3.4.conv1.weight"
    output: "577"
    name: "Conv_120"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "577"
    input: "body.layer3.4.bn1.weight"
    input: "body.layer3.4.bn1.bias"
    input: "body.layer3.4.bn1.running_mean"
    input: "body.layer3.4.bn1.running_var"
    output: "578"
    name: "BatchNormalization_121"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "578"
    output: "579"
    name: "Relu_122"
    op_type: "Relu"
  }
  node {
    input: "579"
    input: "body.layer3.4.conv2.weight"
    output: "580"
    name: "Conv_123"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "580"
    input: "body.layer3.4.bn2.weight"
    input: "body.layer3.4.bn2.bias"
    input: "body.layer3.4.bn2.running_mean"
    input: "body.layer3.4.bn2.running_var"
    output: "581"
    name: "BatchNormalization_124"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "581"
    output: "582"
    name: "Relu_125"
    op_type: "Relu"
  }
  node {
    input: "582"
    input: "body.layer3.4.conv3.weight"
    output: "583"
    name: "Conv_126"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "583"
    input: "body.layer3.4.bn3.weight"
    input: "body.layer3.4.bn3.bias"
    input: "body.layer3.4.bn3.running_mean"
    input: "body.layer3.4.bn3.running_var"
    output: "584"
    name: "BatchNormalization_127"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "584"
    input: "576"
    output: "585"
    name: "Add_128"
    op_type: "Add"
  }
  node {
    input: "585"
    output: "586"
    name: "Relu_129"
    op_type: "Relu"
  }
  node {
    input: "586"
    input: "body.layer3.5.conv1.weight"
    output: "587"
    name: "Conv_130"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "587"
    input: "body.layer3.5.bn1.weight"
    input: "body.layer3.5.bn1.bias"
    input: "body.layer3.5.bn1.running_mean"
    input: "body.layer3.5.bn1.running_var"
    output: "588"
    name: "BatchNormalization_131"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "588"
    output: "589"
    name: "Relu_132"
    op_type: "Relu"
  }
  node {
    input: "589"
    input: "body.layer3.5.conv2.weight"
    output: "590"
    name: "Conv_133"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "590"
    input: "body.layer3.5.bn2.weight"
    input: "body.layer3.5.bn2.bias"
    input: "body.layer3.5.bn2.running_mean"
    input: "body.layer3.5.bn2.running_var"
    output: "591"
    name: "BatchNormalization_134"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "591"
    output: "592"
    name: "Relu_135"
    op_type: "Relu"
  }
  node {
    input: "592"
    input: "body.layer3.5.conv3.weight"
    output: "593"
    name: "Conv_136"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "593"
    input: "body.layer3.5.bn3.weight"
    input: "body.layer3.5.bn3.bias"
